{
  "translation": {
    "progress": "Ei, ainda estou trabalhando neste portfólio — é uma versão em desenvolvimento.",
    "home": "Início",
    "about": "Sobre",
    "portfolio": "Portfólio",
    "contact": "Contato",
    "greatings": "Oi, eu sou",
    "position": "Engenheiro de Software Sênior",
    "skillsPrefix": "Experiente em",
    "aboutTitle": "Sobre mim",
    "aboutText": "Sou desenvolvedor de software com 7 anos de experiência em aplicações escaláveis. Sou apaixonado por novas tecnologias e criar soluções incríveis. Odeio estagnar — estou sempre aprendendo algo novo, seja coding, mercado financeiro (sou investidor) ou viajando (já conheci vários países e pretendo conhecer muito mais).",
    "contactTitle": "Vamos Conversar",
    "contactSubtitle": "Pronto para dar vida às suas ideias? Vamos conversar!",
    "nameField": "Seu Nome",
    "emailField": "Seu Email",
    "messageField": "Sua Mensagem",
    "sendButton": "Enviar Mensagem",
    "projects": [
        {
            "title": "Baixar Mangás",
            "description": "Projeto criado inicialmente como trabalho de conclusão de curso, posteriormente liberado para a comunidade. Um web scraper que busca capítulos de mangás em sites populares, indexando-os e permitindo a conversão para PDF e posteriomente seu download.",
            "images": [],
            "techs": ["NextJS", "Puppeteer", "Tailwind CSS", "NextUI", "Websockets"],
            "link": "https://mangas.vhrita.dev"
        },
        {
            "title": "Paladins Dynamic Overlay",
            "description": "Refatoração de um overlay dinâmico para o jogo Paladins, criado por mim para compor minhas streams em 2018, está Open Source e sendo atualizado com novas tecnologias. Busca informações da partida em tempo real, alterando o overlay do streamer de acordo com o persongagem jogado.",
            "images": [],
            "techs": ["NextJS", "Websockets", "Tailwind CSS", "Rest API", "UX"],
            "link": "https://github.com/vhrita/paladins-dynamic-overlay"
        },
        {
            "title": "Kindle Newsletter",
            "description": "Um serviço simples que envia a newsletter diária do TheNews.cc diretamente para o seu Kindle. Através de scraping, converte o conteúdo em um formato amigável para leitura no Kindle e envia via email.",
            "images": [],
            "techs": ["Node.js", "Cheerio", "Nodemailer"],
            "link": "https://github.com/vhrita/kindle-newsletter"
        },
        {
            "title": "Investidor10 Scraper",
            "description": "Scraper que coleta dados de ativos financeiros do site Investidor10, podendo diponibiliza-los através de Rest API.",
            "images": [],
            "techs": ["ExpressJS", "Puppeteer", "Redis"],
            "link": "https://github.com/vhrita/investidor10-scrap"
        },
        {
            "title": "Definitive Portfolio",
            "description": "Meu site pessoal com React e Framer Motion: animações avançadas, scroll horizontal e carrossel responsivo de projetos.",
            "images": [],
            "techs": ["React.js", "Framer Motion", "SCSS", "ViteJS", "i18n"],
            "link": "https://vhrita.dev"
        }
    ]
  }
}