{
  "translation": {
    "progress": "Hey, I'm still working on this portfolio – it's a development preview.",
    "home": "Home",
    "about": "About",
    "portfolio": "Portfolio",
    "contact": "Contact",
    "greatings": "Hi, I’m",
    "position": "Senior Software Engineer",
    "skillsPrefix": "Skilled in",
    "aboutTitle": "About me",
    "aboutText": "I'm a software developer with 7 years of experience building scalable web apps. I love exploring new technologies, crafting solutions and pushing boundaries. I never settle — I'm always learning something new, whether in code, finance (I'm an investor and market enthusiast) or travel (I've visited many countries and plan to see many more).",
    "contactTitle": "Let's Connect",
    "contactSubtitle": "Ready to bring your ideas to life? Let's talk!",
    "contactInfoTitle": "Get in Touch",
    "phoneLabel": "Phone & WhatsApp",
    "emailLabel": "Email",
    "locationLabel": "Based in",
    "phoneNumber": "+55 11 98918-6251",
    "emailAddress": "vhrita.dev@gmail.com",
    "location": "São Paulo, Brazil",
    "nameField": "Your Name",
    "emailField": "Your Email",
    "messageField": "Your Message",
    "sendButton": "Send Message",
    "sendingButton": "Sending...",
    "formSuccessMessage": "Message sent successfully! I'll get back to you soon.",
    "formErrorMessage": "Error sending message. Please try again.",
    "resume": "Resume",
    "projects": [
      {
        "id": "manga-downloader",
        "title": "Manga Downloader",
        "description": "Originally created as a final graduation project and later open-sourced for the community. A web scraper that fetches manga chapters from popular sites, indexes them, and allows conversion to PDF for download."
      },
      {
        "id": "musa-bot",
        "title": "Musa Bot",
        "description": "A complex Discord bot based on the music fairy Musa from Winx Club, named after my Discord server. Features multi-source audio support, Spotify and YouTube/YoutubeMusic playlist integration, YouTube Resolver subdirectory that can run on lightweight machines like Raspberry Pi, various commands and message control."
      },
      {
        "id": "stella-bot",
        "title": "Stella Bot",
        "description": "Discord bot based on Stella, the fairy of Light from Winx Club, with a creative and fun personality. Stella specializes in generating images from text using AI, featuring multiple quality levels and real-time generation via WebSocket. Future plans include meme generation and other creative content for the server."
      },
      {
        "id": "imagine-ai",
        "title": "Image AI API",
        "description": "Python REST API built to serve and manage image generation models with fallbacks between complex, medium, and fast models. Initially developed to serve Stella-bot when we want to generate higher quality images, but can be implemented in any system that needs AI image generation."
      },
      {
        "id": "paladins-dynamic-overlay",
        "title": "Paladins Dynamic Overlay",
        "description": "A refactored dynamic overlay for Paladins that I built for my streams back in 2018. It's now open-source and continuously updated. It retrieves match data in real time and updates the streamer's overlay based on the champion being played."
      },
      {
        "id": "definitive-portfolio",
        "title": "Definitive Portfolio",
        "description": "My personal website built with React and Framer Motion: featuring advanced animations, horizontal scrolling, and a responsive project carousel."
      },
      {
        "id": "familia-cata-vento",
        "title": "Família Cata-Vento School",
        "description": "Institutional website for a children's education school, featuring modern design and responsive layout for educational content presentation."
      },
      {
        "id": "kindle-newsletter",
        "title": "Kindle Newsletter",
        "description": "A simple script I created that runs daily to capture my favorite newsletter (The News), convert and send it to my Kindle. It was created as a necessary solution to a personal problem I had, completely automating the process of reading newsletters on Kindle."
      },
      {
        "id": "investidor10-scraper",
        "title": "Investidor10 Scraper",
        "description": "Project created to solve a personal problem: As an investor I have spreadsheets to control investments, assets, etc. I needed an API to capture asset data, so I decided to create my own by scraping the portfolio management tool I've always used: Investidor10 (Brazilian). Today this API is used in my Google Sheets through Google App Scripts."
      }
    ]
  }
}
